# PROBLEM STATEMENT

You are working as a car salesman and you would like to develop a model to predict the total dollar amount that customers are willing to pay given the following attributes: 
- Customer Name
- Customer e-mail
- Country
- Gender
- Age
- Annual Salary 
- Credit Card Debt 
- Net Worth 

The model should predict: 
- Car Purchase Amount

## Steps Followed:

- Import the Necessary Libraries
- Import the Data Set
- Visualize Dataset
- Data Cleaning / Creating Test and Training Data sets
- Training the Model
- Evaluating the Model

## 1) Importing the libraries

In [2]:
# Data Manipulation and Numerical Analysis
import pandas as pd 
import numpy as np 

# Data Visulization
import seaborn as sns
import matplotlib.pyplot as plt

## 2) Import the Data Set

In [8]:
car_df = pd.read_csv('D:\\SuperDataScienceTeam\\DeepLearning+ML Case Studies\\DL and ML Practical Tutorials - Package\\Project 1\\Car_Purchasing_Data.csv',
                    encoding = 'ISO-8859-1')

In [9]:
car_df.head(5)

,Customer Name,Customer e-mail,Country,Gender,Age,Annual Salary,Credit Card Debt,Net Worth,Car Purchase Amount
0,Martina Avila,cubilia.Curae.Phasellus@quisaccumsanconvallis.edu,Bulgaria,0,41.851720,62812.09301,11609.380910,238961.2505,35321.45877
1,Harlan Barnes,eu.dolor@diam.co.uk,Belize,0,40.870623,66646.89292,9572.957136,530973.9078,45115.52566
2,Naomi Rodriquez,vulputate.mauris.sagittis@ametconsectetueradip...,Algeria,1,43.152897,53798.55112,11160.355060,638467.1773,42925.70921
3,Jade Cunningham,malesuada@dignissim.com,Cook Islands,1,58.271369,79370.03798,14426.164850,548599.0524,67422.36313
4,Cedric Leach,felis.ullamcorper.viverra@egetmollislectus.net,Brazil,1,57.313749,59729.15130,5358.712177,560304.0671,55915.46248